# Start

from pathlib import Path
import sys

#DictZzz!
#-----------------------------------------------------------------------------------#
en_to_fa = {
    'q':'ض', 'w':'ص', 'e':'ث', 'r':'ق', 't':'ف', 'y':'غ', 'u':'ع',
    'i':'ه', 'o':'خ', 'p':'ح', '[':'ج', ']':'چ', '\\':'پ', 'a':'ش',
    's':'س', 'd':'ی', 'f':'ب', 'g':'ل', 'h':'ا', 'j':'ت', 'k':'ن',
    'l':'م', ';':'ک', "'":'گ', 'z':'ظ', 'x':'ط', 'c':'ز', 'v':'ر',
    'b':'ذ', 'n':'د', 'm':'ئ', ',':'و', '.':'.', '/':'/',

    '{':'ج', '}':'چ', '|':'پ', '<':'و', '>':'.', ':':'ک', '"':'گ',
    '?':'؟', ' ':' ',

    'Q':'ض', 'W':'ص', 'E':'ث', 'R':'ق', 'T':'ف', 'Y':'غ', 'U':'ع', 
    'I':'ه', 'O':'خ', 'P':'ح', 'A':'ش', 'S':'س', 'D':'ی', 'F':'ب',
    'G':'ل', 'H':'ا', 'J':'ت', 'K':'ن', 'L':'م', 'Z':'ظ', 'X':'ط',
    'C':'ز', 'V':'ر', 'B':'ذ', 'N':'د', 'M':'ئ'
}

fa_to_en = {
    'ض':'q', 'ص':'w', 'ث':'e', 'ق':'r', 'ف':'t', 'غ':'y', 'ع':'u',
    'ه':'i', 'خ':'o', 'ح':'p', 'ج':'[', 'چ':']', 'پ':'\\', 'ش':'a',
    'س':'s', 'ی':'d', 'ب':'f', 'ل':'g', 'ا':'h', 'ت':'j', 'ن':'k',
    'م':'l', 'ک':';', 'گ':"'", 'ظ':'z', 'ط':'x', 'ز':'c', 'ر':'v',
    'ذ':'b', 'د':'n', 'ئ':'m', 'و':',', '؟':'?',
    ' ':' '
}

#-----------------------------------------------------------------------------------#

# PatheZzz!
#-----------------------------------------------------------------------------------#
def correct_path(path: str) -> Path :

    if getattr(sys, "frozen", False) :
        base_path = Path(sys._MEIPASS)
    
    else :
        base_path = Path(__file__).resolve().parent

    return base_path / path

def data_path(name: str) -> Path :

    if getattr(sys, "frozen", False) :
        base_path = Path(sys.executable).parent
    
    else :
        base_path = Path(__file__).resolve().parent

    return base_path / name
#-----------------------------------------------------------------------------------#

JSON_SETTING_PATH = data_path("setting.json")

# the END